<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"></ul></div>

In [1]:
import sqlite3
import pandas as pd

In [2]:
con = sqlite3.connect(":memory:")
cur = con.cursor()

https://www.cs.toronto.edu/~delve/data/boston/bostonDetail.html

In [3]:
link = 'https://raw.githubusercontent.com/eric-bunch/boston_housing/master/boston.csv'

In [4]:
data = pd.read_csv(link)
data.rename(columns = {'MDEV':'MEDV'}, inplace=True)

In [5]:
data.to_sql("boston", con, index=False, if_exists="replace")

In [6]:
pd.read_sql(
    """
    SELECT * FROM boston
    limit 5
    """,
    con,
)

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2

In [7]:
pd.read_sql(
    """
    SELECT count(*) FROM boston
    """,
    con,
)

   count(*)
0       506

1. Выведите количество пустых значений по каждой из колонок (название колонки, кол-во пустых значений)

In [8]:
pd.read_sql(
    """
    SELECT distinct 'CRIM' as 'col_name', sum(CRIM IS Null) OVER () as 'nulls' FROM boston
    union all
    SELECT distinct 'ZN' as 'col_name', sum(ZN IS Null) OVER () as 'nulls' FROM boston
    union all
    SELECT distinct 'INDUS' as 'col_name', sum(INDUS IS Null) OVER () as 'nulls' FROM boston
    union all
    SELECT distinct 'CHAS' as 'col_name', sum(CHAS IS Null) OVER () as 'nulls' FROM boston
    union all
    SELECT distinct 'NOX' as 'col_name', sum(NOX IS Null) OVER () as 'nulls' FROM boston
    union all
    SELECT distinct 'RM' as 'col_name', sum(RM IS Null) OVER () as 'nulls' FROM boston
    union all
    SELECT distinct 'AGE' as 'col_name', sum(AGE IS Null) OVER () as 'nulls' FROM boston
    union all
    SELECT distinct 'DIS' as 'col_name', sum(DIS IS Null) OVER () as 'nulls' FROM boston
    union all
    SELECT distinct 'RAD' as 'col_name', sum(RAD IS Null) OVER () as 'nulls' FROM boston
    union all
    SELECT distinct 'TAX' as 'col_name', sum(TAX IS Null) OVER () as 'nulls' FROM boston
    union all
    SELECT distinct 'PTRATIO' as 'col_name', sum(PTRATIO IS Null) OVER () as 'nulls' FROM boston
    union all
    SELECT distinct 'B' as 'col_name', sum(B IS Null) OVER () as 'nulls' FROM boston
    union all
    SELECT distinct 'LSTAT' as 'col_name', sum(LSTAT IS Null) OVER () as 'nulls' FROM boston
    union all
    SELECT distinct 'MEDV' as 'col_name', sum(MEDV IS Null) OVER () as 'nulls' FROM boston
    """,
    con,
)

   col_name  nulls
0      CRIM      0
1        ZN      0
2     INDUS      0
3      CHAS      0
4       NOX      0
5        RM      0
6       AGE      0
7       DIS      0
8       RAD      0
9       TAX      0
10  PTRATIO      0
11        B      0
12    LSTAT      0
13     MEDV      0

In [9]:
pd.read_sql(
    """
    SELECT p. name, p.'notnull' FROM pragma_table_info('boston') p
    """,
    con,
)

       name  notnull
0      CRIM        0
1        ZN        0
2     INDUS        0
3      CHAS        0
4       NOX        0
5        RM        0
6       AGE        0
7       DIS        0
8       RAD        0
9       TAX        0
10  PTRATIO        0
11        B        0
12    LSTAT        0
13     MEDV        0

2. Выведите количество уникальных значений по каждой из колонок (название колонки, кол-во уникальных значений)

In [10]:
pd.read_sql(
    """
    SELECT * FROM boston
    limit 5
    """,
    con,
)

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2

In [11]:
pd.read_sql(
    """
    SELECT distinct 'CRIM' as 'col_name', count(distinct CRIM) as nun FROM boston
    union all
    SELECT distinct 'ZN' as 'col_name', count(distinct ZN) as nun FROM boston
    union all
    SELECT distinct 'INDUS' as 'col_name', count(distinct INDUS) as nun FROM boston
    union all
    SELECT distinct 'CHAS' as 'col_name', count(distinct CHAS) as nun FROM boston
    union all
    SELECT distinct 'NOX' as 'col_name', count(distinct NOX) as nun FROM boston
    union all
    SELECT distinct 'RM' as 'col_name', count(distinct RM) as nun FROM boston
    union all
    SELECT distinct 'AGE' as 'col_name', count(distinct AGE) as nun FROM boston
    union all
    SELECT distinct 'DIS' as 'col_name', count(distinct DIS) as nun FROM boston
    union all
    SELECT distinct 'RAD' as 'col_name', count(distinct RAD) as nun FROM boston
    union all
    SELECT distinct 'TAX' as 'col_name', count(distinct TAX) as nun FROM boston
    union all
    SELECT distinct 'PTRATIO' as 'col_name', count(distinct PTRATIO) as nun FROM boston
    union all
    SELECT distinct 'B' as 'col_name', count(distinct B) as nun FROM boston
    union all
    SELECT distinct 'LSTAT' as 'col_name', count(distinct LSTAT) as nun FROM boston
    union all
    SELECT distinct 'MEDV' as 'col_name', count(distinct MEDV) as nun FROM boston
    """,
    con,
)

   col_name  nun
0      CRIM  504
1        ZN   26
2     INDUS   76
3      CHAS    2
4       NOX   81
5        RM  446
6       AGE  356
7       DIS  412
8       RAD    9
9       TAX   66
10  PTRATIO   46
11        B  357
12    LSTAT  455
13     MEDV  229

3. Выведите колонки, у которых медиана равна минимальному значению (название колонки).
Напишите какой вывод можно сделать по данным в этих колонках

In [12]:
pd.read_sql(
    """
    SELECT * FROM boston
    limit 5
    """,
    con,
)

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2

In [13]:
pd.read_sql(
    """
    WITH 
        crim_cond AS (SELECT 'CRIM' as colname, avg(crim_d)=min(crim) AS cond FROM
            (SELECT crim AS crim_d FROM boston ORDER BY crim
            LIMIT 2 OFFSET (SELECT (count() - 1) / 2 FROM boston)), boston),
  
        zn_cond AS (SELECT 'ZN' as colname, avg(zn_d)=min(zn) AS cond FROM
            (SELECT zn AS zn_d FROM boston ORDER BY zn
            LIMIT 2 OFFSET (SELECT (count() - 1) / 2 FROM boston)), boston),
 
        indus_cond AS (SELECT 'INDUS' as colname, avg(indus_d)=min(indus) AS cond FROM
            (SELECT indus AS indus_d FROM boston ORDER BY indus
            LIMIT 2 OFFSET (SELECT (count() - 1) / 2 FROM boston)), boston),
 
        chas_cond AS (SELECT 'CHAS' as colname, avg(chas_d)=min(chas) AS cond FROM
            (SELECT chas AS chas_d FROM boston ORDER BY chas
            LIMIT 2 OFFSET (SELECT (count() - 1) / 2 FROM boston)), boston),
           
        nox_cond AS (SELECT 'NOX' as colname, avg(nox_d)=min(nox) AS cond FROM
            (SELECT nox AS nox_d FROM boston ORDER BY nox
            LIMIT 2 OFFSET (SELECT (count() - 1) / 2 FROM boston)), boston),

        rm_cond AS (SELECT 'RM' as colname, avg(rm_d)=min(rm) AS cond FROM
            (SELECT rm AS rm_d FROM boston ORDER BY rm
            LIMIT 2 OFFSET (SELECT (count() - 1) / 2 FROM boston)), boston),
            
        age_cond AS (SELECT 'AGE' as colname, avg(age_d)=min(age) AS cond FROM
            (SELECT age AS age_d FROM boston ORDER BY age
            LIMIT 2 OFFSET (SELECT (count() - 1) / 2 FROM boston)), boston),
        
        dis_cond AS (SELECT 'DIS' as colname, avg(dis_d)=min(dis) AS cond FROM
            (SELECT dis AS dis_d FROM boston ORDER BY dis
            LIMIT 2 OFFSET (SELECT (count() - 1) / 2 FROM boston)), boston),
            
        rad_cond AS (SELECT 'RAD' as colname, avg(rad_d)=min(rad) AS cond FROM
            (SELECT rad AS rad_d FROM boston ORDER BY rad
            LIMIT 2 OFFSET (SELECT (count() - 1) / 2 FROM boston)), boston),
            
        tax_cond AS (SELECT 'TAX' as colname, avg(tax_d)=min(tax) AS cond FROM
            (SELECT tax AS tax_d FROM boston ORDER BY tax
            LIMIT 2 OFFSET (SELECT (count() - 1) / 2 FROM boston)), boston),    
            
        ptratio_cond AS (SELECT 'PTRATIO' as colname, avg(ptratio_d)=min(ptratio) AS cond FROM
            (SELECT ptratio AS ptratio_d FROM boston ORDER BY ptratio
            LIMIT 2 OFFSET (SELECT (count() - 1) / 2 FROM boston)), boston),
            
        b_cond AS (SELECT 'B' as colname, avg(b_d)=min(b) AS cond FROM
            (SELECT b AS b_d FROM boston ORDER BY b
            LIMIT 2 OFFSET (SELECT (count() - 1) / 2 FROM boston)), boston),

        lstat_cond AS (SELECT 'LSTAT' as colname, avg(lstat_d)=min(lstat) AS cond FROM
            (SELECT lstat AS lstat_d FROM boston ORDER BY lstat
            LIMIT 2 OFFSET (SELECT (count() - 1) / 2 FROM boston)), boston),

        medv_cond AS (SELECT 'MEDV' as colname, avg(medv_d)=min(medv) AS cond FROM
            (SELECT medv AS medv_d FROM boston ORDER BY medv
            LIMIT 2 OFFSET (SELECT (count() - 1) / 2 FROM boston)), boston)
            
            
            
    SELECT colname FROM (
        SELECT * FROM crim_cond
        UNION ALL
        SELECT * FROM zn_cond
        UNION ALL
        SELECT * FROM indus_cond
        UNION ALL
        SELECT * FROM chas_cond
        UNION ALL
        SELECT * FROM nox_cond
        UNION ALL
        SELECT * FROM rm_cond
        UNION ALL
        SELECT * FROM age_cond
        UNION ALL
        SELECT * FROM rad_cond
        UNION ALL
        SELECT * FROM tax_cond
        UNION ALL
        SELECT * FROM ptratio_cond
        UNION ALL
        SELECT * FROM b_cond
        UNION ALL
        SELECT * FROM lstat_cond
        UNION ALL
        SELECT * FROM medv_cond
    )
    WHERE cond=1
    
    """, con)

  colname
0      ZN
1    CHAS

Вывод:

Оба признака не сбалансированы (кол-во одного значения данного признака по всей выборке сильно приобладает над остальными (>50% от всех наблюдений)). В то-же время признак CHAS - бинарный, в распределении бинарного признака - медиана всегда будет равна либо минимальному либо максимальному значению (за исключением случая когда кол-во наблюдений четное и кол-во разных значений (1 и 0) по выборке равно друг другу, тогда медиана равна их среднему (0.5)). Но в любом случае признак CHAS то-же не сбалансирован.

4. Выведите разницу между среднем количеством комнат(RM) в домах с самой дорогой стоимостью(MEDV) и 25 самыми дешевыми домами. 
Аналогично по 50, 100, 200, 300 самыми дешевыми домами. (кол-во домов(25,50,100,200,300), среднее кол-во комнат в них, среднее кол-во комнат в самых дорогих, разница).
Напишите влияет ли кол-во комнат на стоимость и как сильно.

In [14]:
pd.read_sql(
    """
    SELECT * FROM boston
    limit 5
    """,
    con,
)

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2

In [15]:
pd.read_sql(
    """
    SELECT *, k.avg_ex - avg_min as diff FROM (
    select 25 as quan_h, avg(r.RM) as avg_min, avg(t.RM) as avg_ex from (
    select RM, MEDV FROM boston order by MEDV LIMIT 25) r, 
    (select RM, MEDV, dense_rank() OVER (order by MEDV desc) as rank FROM boston order by MEDV desc) t
    where t.rank = 1
    ) k
    UNION ALL
    SELECT *, k.avg_ex - avg_min as diff FROM (
    select 50 as quan_h, avg(r.RM) as avg_min, avg(t.RM) as avg_ex from (
    select RM, MEDV FROM boston order by MEDV LIMIT 50) r, 
    (select RM, MEDV, dense_rank() OVER (order by MEDV desc) as rank FROM boston order by MEDV desc) t
    where t.rank = 1
    ) k
    UNION ALL
    SELECT *, k.avg_ex - avg_min as diff FROM (
    select 100 as quan_h, avg(r.RM) as avg_min, avg(t.RM) as avg_ex from (
    select RM, MEDV FROM boston order by MEDV LIMIT 100) r, 
    (select RM, MEDV, dense_rank() OVER (order by MEDV desc) as rank FROM boston order by MEDV desc) t
    where t.rank = 1
    ) k
    UNION ALL
    SELECT *, k.avg_ex - avg_min as diff FROM (
    select 200 as quan_h, avg(r.RM) as avg_min, avg(t.RM) as avg_ex from (
    select RM, MEDV FROM boston order by MEDV LIMIT 200) r, 
    (select RM, MEDV, dense_rank() OVER (order by MEDV desc) as rank FROM boston order by MEDV desc) t
    where t.rank = 1
    ) k
    UNION ALL
    SELECT *, k.avg_ex - avg_min as diff FROM (
    select 300 as quan_h, avg(r.RM) as avg_min, avg(t.RM) as avg_ex from (
    select RM, MEDV FROM boston order by MEDV LIMIT 300) r, 
    (select RM, MEDV, dense_rank() OVER (order by MEDV desc) as rank FROM boston order by MEDV desc) t
    where t.rank = 1
    ) k
    """,
    con,
)

   quan_h   avg_min  avg_ex      diff
0      25  5.747840   7.484  1.736160
1      50  5.753240   7.484  1.730760
2     100  5.887120   7.484  1.596880
3     200  5.911705   7.484  1.572295
4     300  5.972227   7.484  1.511773

Вывод:

Влияет - видна положительная корреляция между данными признаками.

5. Выведите ранги значений колонки LSTAT(процент населения с более низким статусом) в домах с самой дорогой стоимостью (значение LSTAT, стоимость, ранг). Напишите какой вывод можно сделать по этим данным.

In [16]:
pd.read_sql(
    """
    select r.LSTAT, r.MEDV, r.ranks FROM (
    select LSTAT, MEDV, dense_rank() OVER (order by MEDV desc) as rank, rank() OVER (order by LSTAT) as ranks FROM boston
    ) r
    where r.rank = 1
    """,
    con,
)

    LSTAT  MEDV  ranks
0    1.73  50.0      1
1    1.92  50.0      2
2    2.88  50.0      6
3    2.96  50.0      8
4    2.97  50.0      9
5    3.16  50.0     15
6    3.26  50.0     17
7    3.32  50.0     18
8    3.70  50.0     26
9    3.73  50.0     27
10   4.45  50.0     41
11   4.63  50.0     50
12   5.12  50.0     67
13   7.44  50.0    141
14   8.88  50.0    181
15   9.53  50.0    203

Вывод:

В домах с самой дорогой стоимостью (MEDV) разброс процента населения с более низким статусом (LSTAT) находится в первой половине всех значений LSTAT (т.е. с преимущественно низким значением процента населения с более низким статусом (LSTAT)).

Значит, в самых дорогих домах процент населения с более низким статусом ожидаемо низок (распределение имеет меньший разброс значений и сдвинуто в сторону минимального значения относительно распределения всех значений LSTAT).

6. Выведите среднюю стоимость домов граничащих с рекой(CHAS) и нет (граничит/не граничит, стоимость)

In [17]:
pd.read_sql(
    """
    with ranks as (
    SELECT CHAS, MEDV, dense_rank() OVER (order BY CHAS) as rank FROM boston
    )
    SELECT distinct CHAS, avg(MEDV) as avg_h FROM ranks where rank = 2
    UNION ALL
    SELECT distinct CHAS, avg(MEDV) as avg_h FROM ranks where rank = 1
    """,
    con,
)

   CHAS      avg_h
0   1.0  28.440000
1   0.0  22.093843

In [18]:
pd.read_sql(
    """
    SELECT count(CHAS) FROM boston
    where CHAS = 1.0
    """,
    con,
)

   count(CHAS)
0           35

7. Выведите все колонки, у которых среднее значение выше, когда дом граничит с рекой (название колонки). Напишите какой вывод можно сделать по этим данным.

In [19]:
pd.read_sql(
    """
SELECT distinct col_name FROM(
    SELECT 'CRIM' AS col_name,(SELECT avg(crim) FROM boston WHERE chas=1)>(SELECT avg(crim) FROM boston WHERE chas=0) AS cond 
    FROM boston
    UNION ALL
    SELECT 'ZN' AS col_name,(SELECT avg(ZN) FROM boston WHERE chas=1)>(SELECT avg(ZN) FROM boston WHERE chas=0) AS cond 
    FROM boston
    UNION ALL
    SELECT 'INDUS' AS col_name,(SELECT avg(INDUS) FROM boston WHERE chas=1)>(SELECT avg(INDUS) FROM boston WHERE chas=0) AS cond 
    FROM boston
    UNION ALL
    SELECT 'NOX' AS col_name,(SELECT avg(NOX) FROM boston WHERE chas=1)>(SELECT avg(NOX) FROM boston WHERE chas=0) AS cond 
    FROM boston
    UNION ALL
    SELECT 'RM' AS col_name,(SELECT avg(RM) FROM boston WHERE chas=1)>(SELECT avg(RM) FROM boston WHERE chas=0) AS cond 
    FROM boston
    UNION ALL
    SELECT 'AGE' AS col_name,(SELECT avg(AGE) FROM boston WHERE chas=1)>(SELECT avg(AGE) FROM boston WHERE chas=0) AS cond 
    FROM boston
    UNION ALL
    SELECT 'DIS' AS col_name,(SELECT avg(DIS) FROM boston WHERE chas=1)>(SELECT avg(DIS) FROM boston WHERE chas=0) AS cond 
    FROM boston
    UNION ALL
    SELECT 'RAD' AS col_name,(SELECT avg(RAD) FROM boston WHERE chas=1)>(SELECT avg(RAD) FROM boston WHERE chas=0) AS cond 
    FROM boston
    UNION ALL
    SELECT 'TAX' AS col_name,(SELECT avg(TAX) FROM boston WHERE chas=1)>(SELECT avg(TAX) FROM boston WHERE chas=0) AS cond 
    FROM boston
    UNION ALL
    SELECT 'PTRATIO' AS col_name,(SELECT avg(PTRATIO) FROM boston WHERE chas=1)>(SELECT avg(PTRATIO) FROM boston WHERE chas=0) AS cond 
    FROM boston
    UNION ALL
    SELECT 'B' AS col_name,(SELECT avg(B) FROM boston WHERE chas=1)>(SELECT avg(B) FROM boston WHERE chas=0) AS cond 
    FROM boston
    UNION ALL
    SELECT 'LSTAT' AS col_name,(SELECT avg(LSTAT) FROM boston WHERE chas=1)>(SELECT avg(LSTAT) FROM boston WHERE chas=0) AS cond 
    FROM boston
    UNION ALL
    SELECT 'MEDV' AS col_name,(SELECT avg(MEDV) FROM boston WHERE chas=1)>(SELECT avg(MEDV) FROM boston WHERE chas=0) AS cond 
    FROM boston
)
where cond = 1
    """,
    con,
)

  col_name
0    INDUS
1      NOX
2       RM
3      AGE
4        B
5     MEDV

Вывод:


INDUS - видимо промышленная застройка локализуется чаще в близи рек, так-же промышленность является одним из градообразующих факторов (скорее всего это связано либо имеет отношение к другим признакам).

NOX - повышенная концентрация оксидов азота, вероятно, вызвана работой промышленных предприятий.

AGE - большая доля старинных/возрастных построек.

RM - большее кол-во комнат возможно связано с тем, что большая часть построек старого типа и раньше были более распространены многокомнатные квартиры.

B - большая доля чернокожих, скорее всего связано с большим кол-вом пром. зон и тем что данные земли относятся к классу рабочих территорий.

MEDV - данный признак коррелирует с кол-вом комнат в квартире.

Итого: данной информации недостаточно, необходим более детальный анализ. Так-же необходимо учитывать что размер выборки не большой.

8. Выведите значения долей промышленной застройки(INDUS), концентрации оксидов азота(NOX) и по их перцентилям - 10, 20 ... 100 ( перцетиль(10,20...100),значение INDUS, значение NOX). Напишите прослеживается между ними взаимосвязь

In [60]:
pd.read_sql(
    """
    SELECT
        100 AS perc, 
        (SELECT indus FROM boston ORDER BY indus LIMIT 1 OFFSET (SELECT count() FROM boston)*10/10-1) AS INDUS,
        (SELECT nox FROM boston ORDER BY nox LIMIT 1 OFFSET (SELECT count() FROM boston)*10/10-1) AS NOX
    UNION ALL
    SELECT
        90 AS perc, 
        (SELECT indus FROM boston ORDER BY indus LIMIT 1 OFFSET (SELECT count() FROM boston)*9/10) AS INDUS,
        (SELECT nox FROM boston ORDER BY nox LIMIT 1 OFFSET (SELECT count() FROM boston)*9/10) AS NOX
    UNION ALL
    SELECT
        80 AS perc, 
        (SELECT indus FROM boston ORDER BY indus LIMIT 1 OFFSET (SELECT count() FROM boston)*8/10) AS INDUS,
        (SELECT nox FROM boston ORDER BY nox LIMIT 1 OFFSET (SELECT count() FROM boston)*8/10) AS NOX
    UNION ALL
    SELECT
        70 AS perc, 
        (SELECT indus FROM boston ORDER BY indus LIMIT 1 OFFSET (SELECT count() FROM boston)*7/10) AS INDUS,
        (SELECT nox FROM boston ORDER BY nox LIMIT 1 OFFSET (SELECT count() FROM boston)*7/10) AS NOX
    UNION ALL
    SELECT
        60 AS perc, 
        (SELECT indus FROM boston ORDER BY indus LIMIT 1 OFFSET (SELECT count() FROM boston)*6/10) AS INDUS,
        (SELECT nox FROM boston ORDER BY nox LIMIT 1 OFFSET (SELECT count() FROM boston)*6/10) AS NOX
    UNION ALL
    SELECT
        50 AS perc, 
        (SELECT indus FROM boston ORDER BY indus LIMIT 1 OFFSET (SELECT count() FROM boston)*5/10) AS INDUS,
        (SELECT nox FROM boston ORDER BY nox LIMIT 1 OFFSET (SELECT count() FROM boston)*5/10) AS NOX
    UNION ALL
    SELECT
        40 AS perc, 
        (SELECT indus FROM boston ORDER BY indus LIMIT 1 OFFSET (SELECT count() FROM boston)*4/10) AS INDUS,
        (SELECT nox FROM boston ORDER BY nox LIMIT 1 OFFSET (SELECT count() FROM boston)*4/10) AS NOX
    UNION ALL
    SELECT
        30 AS perc, 
        (SELECT indus FROM boston ORDER BY indus LIMIT 1 OFFSET (SELECT count() FROM boston)*3/10) AS INDUS,
        (SELECT nox FROM boston ORDER BY nox LIMIT 1 OFFSET (SELECT count() FROM boston)*3/10) AS NOX
    UNION ALL
    SELECT
        20 AS perc, 
        (SELECT indus FROM boston ORDER BY indus LIMIT 1 OFFSET (SELECT count() FROM boston)*2/10) AS INDUS,
        (SELECT nox FROM boston ORDER BY nox LIMIT 1 OFFSET (SELECT count() FROM boston)*2/10) AS NOX
    UNION ALL
    SELECT
        10 AS perc, 
        (SELECT indus FROM boston ORDER BY indus LIMIT 1 OFFSET (SELECT count() FROM boston)*1/10) AS INDUS,
        (SELECT nox FROM boston ORDER BY nox LIMIT 1 OFFSET (SELECT count() FROM boston)*1/10) AS NOX
    """,
    con,
)

   perc  INDUS    NOX
0   100  27.74  0.871
1    90  19.58  0.713
2    80  18.10  0.668
3    70  18.10  0.605
4    60  12.83  0.575
5    50   9.69  0.538
6    40   7.38  0.507
7    30   5.96  0.472
8    20   4.39  0.442
9    10   2.89  0.426

Вывод:

Связь прослеживается, видна корреляция.

CRIM - уровень преступности на душу населения
ZN - доля земель под жилую застройку зонирована под участки площадью более 25 000 кв. футов.
INDUS - доля акров неторгового бизнеса на город.
CHAS - 1, если граничит с рекой, 0 иначе
NOX - концентрация оксидов азота (частей на 10 миллионов)
RM - среднее количество комнат в квартире
AGE - доля жилых домов, построенных до 1940 г.
DIS - взвешенные расстояния до пяти центров занятости Бостона
RAD - индекс доступности к радиальным магистралям
TAX - полная ставка налога на имущество за 10 000 долларов США
PTRATIO - соотношение учеников и учителей по городам
B - 1000(Bk - 0.63)^2, где Bk доля чернокожих людей по городам
LSTAT - % более низкого статуса населения
MEDV - Средняя стоимость домов в 1000 долларов.